import numpy as np

c1 = [3, 5, 6, 8] # n мерные вектора можно поменять цифры
c2 = [4, 9 ,8 ,9]

c1 = np.array(c1)
c2 = np.array(c2)

x = [3, 5, 6, 8]
y = [2, 5 ,8 ,1]

x = np.array(x)
y = np.array(y)


p = [3, 5, 6, 8] #вектор
n = 4
# m <= n m - длинна векторов D и S
gamma = [3, 5, 6, 8] #гамма вектор переименовать
a = 1000 # не нашли описание
b = 1

p = np.array(p)
gamma = np.array(gamma)



def D(p):# должен получиться вектор N мерный
    d = 1 / (n * p) * np.dot(gamma,p) # А. В. Арутюнов, Н. Г. Павлова, А. А. Шананин 11 стр
    return d
print(D(p))

def S(p):
    S= (((a + (b ** 2)) * p)/(b * ((a**2 + b**2)**0.5))) * (np.dot(2,p)**(-1/2)) - 1/n**0.5 # А. В. Арутюнов, Н. Г. Павлова, А. А. Шананин 11 стр
    return S
print(S(p))